{
  "title": "Hola, soy John.",
  "about-me": "Soy un segundo año de licenciado en Ciencias de la Computación en la Universidad Durham. Tengo 4 años de experiencia en desarrollo que van desde web a móvil e incluso al escritorio.",
  "skills": "Habilidades",
  "more": "Más",
  "less": "Menos",
  "options": {
    "lang-option": "Idioma",
    "about-option": "Acerca de",
    "projects-option": "Proyectos",
    "contact-option": "Contactos"
  },
  "picture-of-me": "Imagen de mí",
  "my-cv": "Mi CV",
  "projects": "Proyectos",
  "project-items": {
    "northumberlandchess-title": "Northumberland Chess Association Website",
    "northumberlandchess-bio": "La Asociación de Ajedrez de Northumberland quería que rediseñara su sitio para atraer a más visitantes para leer sobre noticias de ajedrez en la región",
    "northumberlandchess-more": "El cliente, escrito en React Typescript, solicita al servidor Golang que interactúe con la API de Google Drive para buscar los archivos html que contienen los mensajes. La autenticación comienza por iniciar sesión con una cuenta de Google y luego es un JWT es enviado desde el servidor. Esto se actualiza cada 15 minutos para lograr una sesión persistente.",
    "leoallan-title": "Leo Allan Portfolio site",
    "leoallan-bio": "Un fotógrafo y un videografo de Newcastle, Leo Allan, quería un sitio web para mostrar todo su trabajo artístico",
    "leoallan-more": "El cliente React Typescript envía solicitudes al servidor Golang para buscar los ids de las fotos/vídeos a través de la API de Google Drive. La autenticación implica iniciar sesión a través de un portal de inicio de sesión de Google y luego recibir un JWT para mantener una sesión persistente.",
    "moomingame-title": "Moomin Juego",
    "moomingame-bio": "Un juego de plataformas de nivel 2D basado en la serie Moomin finlandesa donde Moomintroll tiene que encontrar un amigo perdido por el nombre de Serena. Moomintroll consigue saltar en plataformas estacionarias y móviles para llegar a hablar con personajes sobre la desaparición de Serena. A lo largo del camino puede recoger las piernas de pollo para darle cuando la encuentre.",
    "moomingame-more": "El juego fue construido usando el motor de juego Unity en 2D. Aprendí a escribir scripts C#, manejar colisiones, hacer animaciones, usar objetos de juego y prefabs.",
    "quicksong-bio": "Una aplicación de música para permitir a los usuarios reproducir música online y sin conexión",
    "quicksong-more": "El Flutter UI gestionó la interfaz para que el usuario iniciara sesión, buscara y descargara canciones fuera de línea o en la lista de reproducción local. El proceso de inicio de sesión atrae la sal de la base de datos según el nombre de usuario, la añade a la contraseña y utiliza una simple función de hash en el cliente que se verifica en la base de datos Raspberry Pi MySQL. Las URL de la canción se raspan usando BeautifulSoup en el backend de Django y se descargan directamente de la fuente por el cliente.",
    "caplin-title": "Caplin Systems",
    "caplin-bio": "Me integré en Caplin Systems, trabajando en mejorar la interfaz de usuario del viejo panel de Admin y conectarlo al backend.",
    "caplin-more": "Usé React JS para crear componentes que encajan con el diseño presentado por el artista UI/UX. Estos componentes fueron revisados por el supervisor de código y probados con guiones Storybook y Jest."
  },
  "contact-me-via": "Póngame en contacto conmigo.",
  "email": "email"
}
