{
  "title": "Hallo, ich bin John",
  "about-me": "Ich bin ein 2. Jahr Computer Science Bachelor an der Durham University. Ich habe 4 Jahre Erfahrung von Web- bis Mobile-und sogar Desktop-.",
  "skills": "Fähigkeiten",
  "more": "Mehr",
  "less": "Weniger",
  "options": {
    "lang-option": "Sprache",
    "about-option": "Über uns",
    "projects-option": "Projekte",
    "contact-option": "Ansprechpartner"
  },
  "picture-of-me": "Bild von mir",
  "my-cv": "Mein Lebenslauf",
  "projects": "Projekte",
  "project-items": {
    "northumberlandchess-title": "Northumberland Chess Association Website",
    "northumberlandchess-bio": "Die Northumberland Chess Association wollte, dass ich ihre Website neu entwerfen, um mehr Besucher über Schachnachrichten in der Region zu informieren",
    "northumberlandchess-more": "Der in React Typescript geschriebene Client fordert den Golang-Server auf, mit der Google Drive API zu interagieren, um die HTML-Dateien, die die Beiträge enthalten, zu holen. Die Authentisierung beginnt, indem Sie sich mit einem Google-Konto anmelden und dann wird ein JWT vom Server gesendet. Dies wird alle 15 Minuten erfrischt, um eine anhaltende Sitzung zu erreichen.",
    "leoallan-title": "Leo Allan Portfolio Website",
    "leoallan-bio": "Ein Newcastle-basierter Fotograf und Videographer Leo Allan, wollte eine Website, um alle seine künstlerische Arbeit zu zeigen",
    "leoallan-more": "Der React Typescript-Client sendet Anfragen an den Golang-Server, um die IDs der Fotos/Videos über die Google Drive API zu holen. Die Authentifizierung beinhaltet das Einloggen über ein Google-Login-Portal und das Empfangen eines JWT, um eine persistente Sitzung zu halten.",
    "moomingame-title": "Moomin Spiel",
    "moomingame-bio": "Ein 2D-level-basiertes Platformer-Spiel basiert auf der finnischen Moomin-Serie, wo Moomintroll einen verlorenen Freund unter dem Namen Serena finden muss. Moomintroll wird auf stationäre und bewegende Plattformen springen, um mit Zeichen über das Verschwinden von Serena zu sprechen. So wie er Hühnerbeine sammeln kann, um ihr zu geben, wenn er sie findet.",
    "moomingame-more": "Das Spiel wurde mit der Unity Spiel Engine in 2D gebaut. Ich lernte, wie man C#-Skripte schreibt, Kollisionen behandelt, Animationen macht, Spielobjekte und Prefabs verwendet.",
    "quicksong-bio": "Eine Musik-Spiel-App, um Benutzern zu ermöglichen, Musik offline und online spielen",
    "quicksong-more": "Die Flutter UI verwaltete die Schnittstelle für den Benutzer, um Songs offline oder auf lokale Wiedergabeliste einzuloggen, zu suchen und herunterzuladen. Der Login-Prozess holt das Salz aus der Datenbank nach dem Benutzernamen, fügt es zum Passwort hinzu und verwendet eine einfache Hash-Funktion auf dem Client, die dann auf der Raspberry Pi MySQL Datenbank überprüft wird. Die Lied-URLs werden mit BeautifulSoup am Django Backend abgeschabt und vom Client direkt aus der Quelle heruntergeladen.",
    "caplin-title": "Caplin Systems",
    "caplin-bio": "Ich bin bei Caplin Systems interniert und arbeitete an der Verbesserung der UI des alten Admin-Panels und die Verbindung mit dem Backend.",
    "caplin-more": "Ich habe React JS verwendet, um Komponenten zu schaffen, die mit dem Design des UI/UX-Künstlers passen. Diese Komponenten wurden dann vom Code-Supervisor überprüft und mit Storybook und Jest Skripten getestet."
  },
  "contact-me-via": "Kontaktieren Sie mich via",
  "email": "E-Mail senden"
}
