{
  "title": "hola soy juan",
  "about-me": "Soy estudiante de segundo año de Ciencias de la Computación en la Universidad de Durham. Tengo 4 años de experiencia en desarrollo, desde web hasta dispositivos móviles e incluso escritorio.",
  "skills": "Habilidades",
  "more": "Más",
  "less": "Menos",
  "options": {
    "lang-option": "Idioma",
    "about-option": "Sobre",
    "projects-option": "Proyectos",
    "contact-option": "Contactos"
  },
  "picture-of-me": "Foto de mi",
  "my-cv": "Mi CV",
  "projects": "Proyectos",
  "project-items": {
    "northumberlandchess-title": "Sitio web de la Asociación de Ajedrez de Northumberland",
    "northumberlandchess-bio": "La Asociación de Ajedrez de Northumberland quería que yo rediseñara su sitio para atraer a más visitantes a leer sobre noticias de ajedrez en la región.",
    "northumberlandchess-more": "El cliente, escrito en React Typescript, solicita al servidor Golang que interactúe con la API de Google Drive para recuperar los archivos html que contienen las publicaciones. La autenticación comienza iniciando sesión con una cuenta de Google y luego se envía un JWT desde el servidor. Esto se actualiza cada 15 minutos para lograr una sesión persistente.",
    "leoallan-title": "Sitio de la cartera de Leo Allan",
    "leoallan-bio": "Un fotógrafo y videógrafo residente en Newcastle, Leo Allan, quería un sitio web para mostrar todo su trabajo artístico.",
    "leoallan-more": "El cliente de React Typescript envía solicitudes al servidor de Golang para obtener las identificaciones de las fotos/videos a través de la API de Google Drive. La autenticación implica iniciar sesión a través de un portal de inicio de sesión de Google y luego recibir un JWT para mantener una sesión persistente.",
    "moomingame-title": "Juego de los Mumins",
    "moomingame-bio": "Un juego de plataformas en 2D basado en niveles basado en la serie finlandesa Moomin donde Moomintroll tiene que encontrar a una amiga perdida llamada Serena. Moomintroll salta sobre plataformas estacionarias y móviles para hablar con los personajes sobre la desaparición de Serena. En el camino, puede recolectar muslos de pollo para dárselos cuando la encuentre.",
    "moomingame-more": "El juego fue construido utilizando el motor de juego Unity en 2D. Aprendí a escribir scripts en C#, manejar colisiones, hacer animaciones, usar objetos de juegos y prefabricados.",
    "quicksong-bio": "Una aplicación de reproducción de música que permite a los usuarios reproducir música sin conexión y en línea",
    "quicksong-more": "La interfaz de usuario de Flutter administró la interfaz para que el usuario iniciara sesión, buscara y descargara canciones sin conexión o en la lista de reproducción local. El proceso de inicio de sesión obtiene la sal de la base de datos de acuerdo con el nombre de usuario, la agrega a la contraseña y utiliza una función hash simple en el cliente que luego se verifica en la base de datos Raspberry Pi MySQL. Las URL de las canciones se raspan usando BeautifulSoup en el backend de Django y el cliente las descarga directamente desde la fuente.",
    "caplin-title": "Sistemas Caplin",
    "caplin-bio": "Hice una pasantía en Caplin Systems, trabajando para mejorar la interfaz de usuario del antiguo panel de administración y conectarlo al backend.",
    "caplin-more": "Usé React JS para crear componentes que encajaran con el diseño presentado por el artista de UI/UX. Luego, el supervisor de código revisó estos componentes y los probó con guiones Storybook y Jest."
  },
  "contact-me-via": "Contáctame a través de",
  "email": "Email"
}
