{
  "title": "Salut, je suis John",
  "about-me": "Je suis en 2e année de licence en informatique à l'université de Durham. J'ai 4 ans d'expérience en développement allant du web au mobile et même au bureau.",
  "skills": "Compétences",
  "more": "Suite",
  "less": "Moins",
  "options": {
    "lang-option": "Langue",
    "about-option": "À propos de",
    "projects-option": "Projets",
    "contact-option": "Contacts"
  },
  "picture-of-me": "Photo de moi",
  "my-cv": "Mon CV",
  "projects": "Projets",
  "project-items": {
    "northumberlandchess-title": "Site Web de l'Association d'échecs de Northumberland",
    "northumberlandchess-bio": "La Northumberland Chess Association voulait que je remanie leur site pour attirer plus de visiteurs à lire sur les actualités des échecs dans la région",
    "northumberlandchess-more": "Le client, écrit en React Typescript, demande au serveur Golang d'interagir avec l'API Google Drive pour récupérer les fichiers html contenant les publications. L'authentification commence par la connexion avec un compte Google, puis c'est un JWT qui est envoyé depuis le serveur. Ceci est actualisé toutes les 15 minutes pour obtenir une session persistante.",
    "leoallan-title": "Site du portfolio de Leo Allan",
    "leoallan-bio": "Un photographe et vidéaste basé à Newcastle, Leo Allan, voulait un site Web pour afficher tout son travail artistique",
    "leoallan-more": "Le client React Typescript envoie des requêtes au serveur Golang pour récupérer les identifiants des photos/vidéos via l'API Google Drive. L'authentification implique la connexion via un portail de connexion Google, puis la réception d'un JWT pour maintenir une session persistante.",
    "moomingame-title": "Jeu Moumine",
    "moomingame-bio": "Un jeu de plateforme basé sur le niveau 2D basé sur la série finlandaise Moomin où Moomintroll doit retrouver une amie perdue du nom de Serena. Moomintroll peut sauter sur des plates-formes fixes et mobiles pour parler aux personnages de la disparition de Serena. En chemin, il peut ramasser des cuisses de poulet à lui donner quand il la trouvera.",
    "moomingame-more": "Le jeu a été construit en utilisant le moteur de jeu Unity en 2D. J'ai appris à écrire des scripts C#, à gérer les collisions, à créer des animations, à utiliser des objets de jeu et des préfabriqués.",
    "quicksong-bio": "Une application de lecture de musique pour permettre aux utilisateurs de jouer de la musique hors ligne et en ligne",
    "quicksong-more": "L'interface utilisateur Flutter a géré l'interface permettant à l'utilisateur de se connecter, de rechercher et de télécharger des chansons hors ligne ou sur une liste de lecture locale. Le processus de connexion récupère le sel de la base de données en fonction du nom d'utilisateur, l'ajoute au mot de passe et utilise une simple fonction de hachage sur le client qui est ensuite vérifiée sur la base de données Raspberry Pi MySQL. Les URL des chansons sont extraites à l'aide de BeautifulSoup sur le backend Django et téléchargées directement depuis la source par le client.",
    "caplin-title": "Caplin Systèmes",
    "caplin-bio": "J'ai effectué un stage chez Caplin Systems, travaillant à l'amélioration de l'interface utilisateur de l'ancien panneau d'administration et à sa connexion au backend.",
    "caplin-more": "J'ai utilisé React JS pour créer des composants qui correspondent au design proposé par l'artiste UI/UX. Ces composants ont ensuite été examinés par le superviseur du code et testés avec les scripts Storybook et Jest."
  },
  "contact-me-via": "Contactez-moi via",
  "email": "e-mail"
}
